HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxHsct_bf.h
/**
 * \file IfxHsct_bf.h
 * \brief
 * \copyright Copyright (c) 2018 Infineon Technologies AG. All rights reserved.
 *
 *
 * Version: TC38XA_UM_V1.0.0.R0
 * Specification: TC3xx User Manual V1.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) is supplying this file for use
 * exclusively with Infineon's microcontroller products. This file can be freely
 * distributed within development tools that are supporting such microcontroller
 * products.
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 * \defgroup IfxSfr_Hsct_Registers_BitfieldsMask Bitfields mask and offset
 * \ingroup IfxSfr_Hsct_Registers
 * 
 */
#ifndef IFXHSCT_BF_H
#define IFXHSCT_BF_H 1

/******************************************************************************/

/******************************************************************************/

/** \addtogroup IfxSfr_Hsct_Registers_BitfieldsMask
 * \{  */
/** \brief Length for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_LEN (1u)

/** \brief Mask for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_CLC_Bits.DISR */
#define IFX_HSCT_CLC_DISR_OFF (0u)

/** \brief Length for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_LEN (1u)

/** \brief Mask for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_CLC_Bits.DISS */
#define IFX_HSCT_CLC_DISS_OFF (1u)

/** \brief Length for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_LEN (1u)

/** \brief Mask for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_CLC_Bits.EDIS */
#define IFX_HSCT_CLC_EDIS_OFF (3u)

/** \brief Length for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_LEN (8u)

/** \brief Mask for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_MSK (0xffu)

/** \brief Offset for Ifx_HSCT_ID_Bits.MOD_REV */
#define IFX_HSCT_ID_MOD_REV_OFF (0u)

/** \brief Length for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_LEN (8u)

/** \brief Mask for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_MSK (0xffu)

/** \brief Offset for Ifx_HSCT_ID_Bits.MOD_TYPE */
#define IFX_HSCT_ID_MOD_TYPE_OFF (8u)

/** \brief Length for Ifx_HSCT_ID_Bits.MOD_NUM */
#define IFX_HSCT_ID_MOD_NUM_LEN (16u)

/** \brief Mask for Ifx_HSCT_ID_Bits.MOD_NUM */
#define IFX_HSCT_ID_MOD_NUM_MSK (0xffffu)

/** \brief Offset for Ifx_HSCT_ID_Bits.MOD_NUM */
#define IFX_HSCT_ID_MOD_NUM_OFF (16u)

/** \brief Length for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_LEN (1u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.SYS_CLK_EN */
#define IFX_HSCT_INIT_SYS_CLK_EN_OFF (1u)

/** \brief Length for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_LEN (1u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.IFM */
#define IFX_HSCT_INIT_IFM_OFF (3u)

/** \brief Length for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_LEN (2u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.SRCF */
#define IFX_HSCT_INIT_SRCF_OFF (4u)

/** \brief Length for Ifx_HSCT_INIT_Bits.SSCF */
#define IFX_HSCT_INIT_SSCF_LEN (2u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.SSCF */
#define IFX_HSCT_INIT_SSCF_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.SSCF */
#define IFX_HSCT_INIT_SSCF_OFF (6u)

/** \brief Length for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_LEN (3u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_MSK (0x7u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.TXHD */
#define IFX_HSCT_INIT_TXHD_OFF (16u)

/** \brief Length for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_LEN (3u)

/** \brief Mask for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_MSK (0x7u)

/** \brief Offset for Ifx_HSCT_INIT_Bits.RXHD */
#define IFX_HSCT_INIT_RXHD_OFF (19u)

/** \brief Length for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_LEN (8u)

/** \brief Mask for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_MSK (0xffu)

/** \brief Offset for Ifx_HSCT_IFCTRL_Bits.IFCVS */
#define IFX_HSCT_IFCTRL_IFCVS_OFF (0u)

/** \brief Length for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_LEN (1u)

/** \brief Mask for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IFCTRL_Bits.SIFCV */
#define IFX_HSCT_IFCTRL_SIFCV_OFF (8u)

/** \brief Length for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_LEN (2u)

/** \brief Mask for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_IFCTRL_Bits.MRXSPEED */
#define IFX_HSCT_IFCTRL_MRXSPEED_OFF (16u)

/** \brief Length for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_LEN (2u)

/** \brief Mask for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_MSK (0x3u)

/** \brief Offset for Ifx_HSCT_IFCTRL_Bits.MTXSPEED */
#define IFX_HSCT_IFCTRL_MTXSPEED_OFF (18u)

/** \brief Length for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_LEN (1u)

/** \brief Mask for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_IFCTRL_Bits.IFTESTMD */
#define IFX_HSCT_IFCTRL_IFTESTMD_OFF (20u)

/** \brief Length for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_LEN (1u)

/** \brief Mask for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_SLEEPCTRL_Bits.SLPEN */
#define IFX_HSCT_SLEEPCTRL_SLPEN_OFF (0u)

/** \brief Length for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_LEN (1u)

/** \brief Mask for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_MSK (0x1u)

/** \brief Offset for Ifx_HSCT_SLEEPCTRL_Bits.SLPCLKG */
#define IFX_HSCT_SLEEPCTRL_SLPCLKG_OFF (1u)

/** \brief Length for Ifx_HSCT_SLEEPCTRL_Bits.WKUPCNT */
#define IFX_HSCT_SLEEPCTRL_WKUPCNT_LEN (8u)

/** \brief Mask for Ifx_HSCT_SLEEPCTRL_Bits.WKUPCNT */
#define IFX_HSCT_SLEEPCTRL_WKUPCNT_MSK (0xffu)

/** \brief Offset for Ifx_HSCT_SLEEPCTRL_Bits.WKUPCNT */
#define IFX_HSCT_SLEEPCTRL_WKUPCNT_OFF (16u)

